django-wardlow/msp432p4-rfid-driver/rfid_driver.c
    // Reset baud rates
    PCD_WriteRegister(TxModeReg, 0x00);
    PCD_WriteRegister(RxModeReg, 0x00);
    // Reset ModWidthReg
    PCD_WriteRegister(ModWidthReg, 0x26);

    // When communicating with a PICC we need a timeout if something goes wrong.
    // f_timer = 13.56 MHz / (2*TPreScaler+1) where TPreScaler = [TPrescaler_Hi:TPrescaler_Lo].
    // TPrescaler_Hi are the four low bits in TModeReg. TPrescaler_Lo is TPrescalerReg.
    PCD_WriteRegister(TModeReg, 0x80);      // TAuto=1; timer starts automatically at the end of the transmission in all communication modes at all speeds
    PCD_WriteRegister(TPrescalerReg, 0xA9); // TPreScaler = TModeReg[3..0]:TPrescalerReg, ie 0x0A9 = 169 => f_timer=40kHz, ie a timer period of 25μs.
    PCD_WriteRegister(TReloadRegH, 0x03);   // Reload timer with 0x3E8 = 1000, ie 25ms before timeout.
    PCD_WriteRegister(TReloadRegL, 0xE8);

    PCD_WriteRegister(TxASKReg, 0x40); // Default 0x00. Force a 100 % ASK modulation independent of the ModGsPReg register setting
    PCD_WriteRegister(ModeReg, 0x3D);  // Default 0x3F. Set the preset value for the CRC coprocessor for the CalcCRC command to 0x6363 (ISO 14443-3 part 6.2.4)
    PCD_AntennaOn();                   // Enable the antenna driver pins TX1 and TX2 (they were disabled by the reset)
} // End PCD_Init()

/**
 * Performs a soft reset on the MFRC522 chip and waits for it to be ready again.
 */
void PCD_Reset()
{
    PCD_WriteRegister(CommandReg, PCD_SoftReset); // Issue the SoftReset command.
    // The datasheet does not mention how long the SoftRest command takes to complete.
    // But the MFRC522 might have been in soft power-down mode (triggered by bit 4 of CommandReg)
    // Section 8.8.2 in the datasheet says the oscillator start-up time is the start up time of the crystal + 37,74μs. Let us be generous: 50ms.
    uint8_t count = 0;
    do
    {
        // Wait for the PowerDown bit in CommandReg to be cleared (max 3x50ms)
        DelayMs(50);
    } while ((PCD_ReadRegister(CommandReg) & (1 << 4)) && (++count) < 3);
} // End PCD_Reset()

/**
 * Turns the antenna on by enabling pins TX1 and TX2.
 * After a reset these pins are disabled.
 */
void PCD_AntennaOn()
{
    uint8_t value = PCD_ReadRegister(TxControlReg);
    if ((value & 0x03) != 0x03)
    {
        PCD_WriteRegister(TxControlReg, value | 0x03);
    }
} // End PCD_AntennaOn()

/**
 * Turns the antenna off by disabling pins TX1 and TX2.
 */
void PCD_AntennaOff()
{
    PCD_ClearRegisterBitMask(TxControlReg, 0x03);
} // End PCD_AntennaOff()

/**
 * Get the current MFRC522 Receiver Gain (RxGain[2:0]) value.
 * See 9.3.3.6 / table 98 in http://www.nxp.com/documents/data_sheet/MFRC522.pdf
 * NOTE: Return value scrubbed with (0x07<<4)=01110000b as RCFfgReg may use reserved bits.
 *
 * @return Value of the RxGain, scrubbed to the 3 bits used.
 */
uint8_t PCD_GetAntennaGain()
{
    return PCD_ReadRegister(RFCfgReg) & (0x07 << 4);
} // End PCD_GetAntennaGain()

/**
 * Set the MFRC522 Receiver Gain (RxGain) to value specified by given mask.
 * See 9.3.3.6 / table 98 in http://www.nxp.com/documents/data_sheet/MFRC522.pdf
 * NOTE: Given mask is scrubbed with (0x07<<4)=01110000b as RCFfgReg may use reserved bits.
 */
void PCD_SetAntennaGain(uint8_t mask)
{
    if (PCD_GetAntennaGain() != mask)
    {                                                         // only bother if there is a change
        PCD_ClearRegisterBitMask(RFCfgReg, (0x07 << 4));      // clear needed to allow 000 pattern
        PCD_SetRegisterBitMask(RFCfgReg, mask & (0x07 << 4)); // only set RxGain[2:0] bits
    }
} // End PCD_SetAntennaGain()

/////////////////////////////////////////////////////////////////////////////////////
// Power control
/////////////////////////////////////////////////////////////////////////////////////

// IMPORTANT NOTE!!!!
// Calling any other function that uses CommandReg will disable soft power down mode !!!
// For more details about power control, refer to the datasheet - page 33 (8.6)

void PCD_SoftPowerDown()
{                                               // Note : Only soft power down mode is available throught software
    uint8_t val = PCD_ReadRegister(CommandReg); // Read state of the command register
    val |= (1 << 4);                            // set PowerDown bit ( bit 4 ) to 1
    PCD_WriteRegister(CommandReg, val);         // write new value to the command register
}

void PCD_SoftPowerUp()
{
    uint8_t val = PCD_ReadRegister(CommandReg); // Read state of the command register
    val &= ~(1 << 4);                           // set PowerDown bit ( bit 4 ) to 0
    PCD_WriteRegister(CommandReg, val);         // write new value to the command register
    // wait until PowerDown bit is cleared (this indicates end of wake up procedure)
    uint32_t trys = 32000; // create timer for timeout (just in case)

    while (trys > 0)
    {
        trys--;                             // set timeout to 500 ms
        val = PCD_ReadRegister(CommandReg); // Read state of the command register
        if (!(val & (1 << 4)))
        {          // if powerdown bit is 0
            break; // wake up procedure is finished
        }
    }
}

/////////////////////////////////////////////////////////////////////////////////////
// Functions for communicating with PICCs
/////////////////////////////////////////////////////////////////////////////////////

/**
 * Executes the Transceive command.
 * CRC validation can only be done if backData and backLen are specified.
 *
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
StatusCode PCD_TransceiveData(uint8_t *sendData,  ///< Pointer to the data to transfer to the FIFO.
                              uint8_t sendLen,    ///< Number of uint8_ts to transfer to the FIFO.
                              uint8_t *backData,  ///< nullptr or pointer to buffer if data should be read back after executing the command.
                              uint8_t *backLen,   ///< In: Max number of uint8_ts to write to *backData. Out: The number of uint8_ts returned.
                              uint8_t *validBits, ///< In/Out: The number of valid bits in the last uint8_t. 0 for 8 valid bits. Default nullptr.
                              uint8_t rxAlign,    ///< In: Defines the bit position in backData[0] for the first bit received. Default 0.
                              int checkCRC        ///< In: True => The last two uint8_ts of the response is assumed to be a CRC_A that must be validated.
)
{
    uint8_t waitIRq = 0x30; // RxIRq and IdleIRq
    return PCD_CommunicateWithPICC(PCD_Transceive, waitIRq, sendData, sendLen, backData, backLen, validBits, rxAlign, checkCRC);
} // End PCD_TransceiveData()

/**
 * Transfers data to the MFRC522 FIFO, executes a command, waits for completion and transfers data back from the FIFO.
 * CRC validation can only be done if backData and backLen are specified.
 *
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
StatusCode PCD_CommunicateWithPICC(uint8_t command,    ///< The command to execute. One of the PCD_Command enums.
                                   uint8_t waitIRq,    ///< The bits in the ComIrqReg register that signals successful completion of the command.
                                   uint8_t *sendData,  ///< Pointer to the data to transfer to the FIFO.
                                   uint8_t sendLen,    ///< Number of uint8_ts to transfer to the FIFO.
                                   uint8_t *backData,  ///< nullptr or pointer to buffer if data should be read back after executing the command.
                                   uint8_t *backLen,   ///< In: Max number of uint8_ts to write to *backData. Out: The number of uint8_ts returned.
                                   uint8_t *validBits, ///< In/Out: The number of valid bits in the last uint8_t. 0 for 8 valid bits.
                                   uint8_t rxAlign,    ///< In: Defines the bit position in backData[0] for the first bit received. Default 0.
                                   int checkCRC        ///< In: True => The last two uint8_ts of the response is assumed to be a CRC_A that must be validated.
)
{
    // Prepare values for BitFramingReg
    uint8_t txLastBits = validBits ? *validBits : 0;
    uint8_t bitFraming = (rxAlign << 4) + txLastBits; // RxAlign = BitFramingReg[6..4]. TxLastBits = BitFramingReg[2..0]

